# 4. Transform the Data
 
> "What is measured may not help answer what is needed"

- **Convert** e.g. free text to coded value
- **Calculate** e.g. percentages, proportion
- **Merge** e.g. first and surname for full name
- **Aggregate** e.g. rollup by year, cluster by area
- **Filter** e.g. exclude based on location
- **Sample** e.g. extract a representative data
- **Summary** e.g. show summary stats like mean

## Let us read the data

In [1]:
# Import the library we need, which is Pandas
import pandas as pd

You will find the variable `df` used quite often to store a `dataframe`

In [2]:
# Read the csv file of Monthwise Quantity and Price csv file we have.
df = pd.read_csv('MonthWiseMarketArrivals_clean.csv')

## Understand Data Structure and Types

In [3]:
df.shape

(11682, 10)

In [4]:
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
0,ABOHAR(PB),January,2005,2350,404,493,446,PB,ABOHAR,January-2005
1,ABOHAR(PB),January,2006,900,487,638,563,PB,ABOHAR,January-2006
2,ABOHAR(PB),January,2010,790,1283,1592,1460,PB,ABOHAR,January-2010
3,ABOHAR(PB),January,2011,245,3067,3750,3433,PB,ABOHAR,January-2011
4,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR,January-2012

### Data Structure

So we have ten columns in our dataset. Let us understand what each one is.

Three are about the location of the Wholesale Market where Onion where sold.
- **state**: This is the 2 letter abbreviation for the state in India (PB is Punjab and so on)
- **city**: This is the city in India (ABOHAR, BANGALORE and so on)
- **market**: This is a string with the combination of the state and city

Three are related to the 
- **month**: Month in January, February and so on. 
- **year**: Year in YYYY representastion
- **date**: The combination of the two above.

Four are about quantity and price in these wholesale market. 
- **quantity**: The quanity of Onion arriving in the market in that month in quintals (100 kg)
- **priceMin**: The minimum price in the month in Rs./quintal
- **priceMax**: The maximum price in the month in Rs./quintal
- **priceMod**: The modal price in the month in Rs./quintal

We would expect the following the columns to be of the following type
- **CATEGORICAL**: state, city, market
- **TIME INTERVAL**: month, year, date
- **QUANTITATIVE**: quantity, priceMin, priceMax, priceModal

Let us see what pandas dataframe is reading these columns as.

In [5]:
# Get the typeof each column
df.dtypes

market      object
month       object
year         int64
quantity     int64
priceMin     int64
priceMax     int64
priceMod     int64
state       object
city        object
date        object
dtype: object

So we are getting the quantitive columns are correctly being shown as integers and the categorical columns are showing as objects(strings) which is fine. 
However, the `date` columns is being read as an object and not a Time-Interval. Let us at least fix the `date` column and make it into a datetime object

In [6]:
# Changing the date column to a Time Interval columnn
df.date = pd.DatetimeIndex(df.date)

In [7]:
df.shape

(11682, 10)

In [8]:
# Now checking for type of each column
df.dtypes

market              object
month               object
year                 int64
quantity             int64
priceMin             int64
priceMax             int64
priceMod             int64
state               object
city                object
date        datetime64[ns]
dtype: object

In [9]:
# Let us see the dataframe again now
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
0,ABOHAR(PB),January,2005,2350,404,493,446,PB,ABOHAR,2005-01-01
1,ABOHAR(PB),January,2006,900,487,638,563,PB,ABOHAR,2006-01-01
2,ABOHAR(PB),January,2010,790,1283,1592,1460,PB,ABOHAR,2010-01-01
3,ABOHAR(PB),January,2011,245,3067,3750,3433,PB,ABOHAR,2011-01-01
4,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR,2012-01-01

### Exercise

Find the starting date for the database?

In [9]:
df.date.min()

Timestamp('1996-01-01 00:00:00')

Find the maximum quantity of Onion sold in a month?

In [16]:
df.quantity.max()

1974018

Find the maximum and minimum Price for Onion in India?

In [17]:
df.priceMax.max()

12000

In [18]:
df.priceMin.min()

16

Find the number of unique cities and states in this database?

In [19]:
len(df.city.unique())

177

In [20]:
len(df.state.unique())

23

## Question 1 - How big is the Bangalore & Delhi onion market compared to other cities in India?

Let us try to do this examination for one of the year only. So we want to reduce our dataframe for only where the year = 2016. This process is called subset.

### PRINCIPLE: Subset a Dataframe

![](../img/subsetrows.png)

How do you subset a dataframe on a given criteria

`newDataframe` = `df`[ <`subset condition`> ]

In [21]:
df2016 = df[df.year == 2016]

In [22]:
df2016.head(10)

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
48,ABOHAR(PB),June,2016,710,523,755,613,PB,ABOHAR,2016-06-01
64,ABOHAR(PB),August,2016,60,650,1065,850,PB,ABOHAR,2016-08-01
72,ABOHAR(PB),September,2016,400,650,800,725,PB,ABOHAR,2016-09-01
80,ABOHAR(PB),October,2016,350,700,900,850,PB,ABOHAR,2016-10-01
88,ABOHAR(PB),November,2016,590,775,1059,888,PB,ABOHAR,2016-11-01
96,ABOHAR(PB),December,2016,330,688,1100,873,PB,ABOHAR,2016-12-01
108,AGRA(UP),January,2016,134200,1039,1443,1349,UP,AGRA,2016-01-01
121,AGRA(UP),February,2016,124508,895,1220,1130,UP,AGRA,2016-02-01
132,AGRA(UP),March,2016,120500,750,1085,1011,UP,AGRA,2016-03-01
144,AGRA(UP),April,2016,99700,697,1020,957,UP,AGRA,2016-04-01

In [24]:
# We can also subset on multiple criterias
df2016Bang = df[(df.year == 2016) & (df.city == 'BANGALORE')]

In [25]:
df2016Bang

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
859,BANGALORE,January,2016,507223,200,1943,1448,KT,BANGALORE,2016-01-01
873,BANGALORE,February,2016,465640,200,1426,1027,KT,BANGALORE,2016-02-01
886,BANGALORE,March,2016,444696,200,1075,750,KT,BANGALORE,2016-03-01
899,BANGALORE,April,2016,426567,200,1102,753,KT,BANGALORE,2016-04-01
912,BANGALORE,May,2016,465936,218,1111,803,KT,BANGALORE,2016-05-01
925,BANGALORE,June,2016,418794,187,1276,903,KT,BANGALORE,2016-06-01
938,BANGALORE,July,2016,452828,200,1272,985,KT,BANGALORE,2016-07-01
951,BANGALORE,August,2016,562522,200,1208,897,KT,BANGALORE,2016-08-01
964,BANGALORE,September,2016,831895,195,1048,758,KT,BANGALORE,2016-09-01
977,BANGALORE,October,2016,1620273,216,1103,680,KT,BANGALORE,2016-10-01
990,BANGALORE,November,2016,1974018,196,1465,881,KT,BANGALORE,2016-11-01
1003,BANGALORE,December,2016,947081,192,1315,875,KT,BANGALORE,2016-12-01

### Exercise

Subset the dataframe for Delhi in 2016.

In [31]:
dfDelhi = df[df.city == "DELHI"]
dfDelhi.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
2378,DELHI,January,2003,246040,146,370,280,DL,DELHI,2003-01-01
2379,DELHI,January,2004,206360,471,1065,928,DL,DELHI,2004-01-01
2380,DELHI,January,2005,237510,212,551,489,DL,DELHI,2005-01-01
2381,DELHI,January,2006,246900,390,598,541,DL,DELHI,2006-01-01
2382,DELHI,January,2007,190560,808,1215,1022,DL,DELHI,2007-01-01

Find the city with the highest onion quantity sold in a month?

In [33]:
df.sort_values(by='quantity', ascending = False).head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
990,BANGALORE,November,2016,1974018,196,1465,881,KT,BANGALORE,2016-11-01
974,BANGALORE,October,2013,1639032,2213,4698,3430,KT,BANGALORE,2013-10-01
977,BANGALORE,October,2016,1620273,216,1103,680,KT,BANGALORE,2016-10-01
976,BANGALORE,October,2015,1612160,385,3365,2215,KT,BANGALORE,2015-10-01
968,BANGALORE,October,2007,1437923,409,1323,1043,KT,BANGALORE,2007-10-01

In [26]:
df.priceMax.max()

12000

In [27]:
df[df.priceMax == df.priceMax.max()]

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
8936,PIPLYA (M.P.),August,2016,2300,3000,12000,7800,MP,PIPLYA,2016-08-01

In [28]:
df.sort_values(by="priceMax", ascending=False).head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
8936,PIPLYA (M.P.),August,2016,2300,3000,12000,7800,MP,PIPLYA,2016-08-01
11313,UJJAIN(MP),August,2016,144,2000,10400,7557,MP,UJJAIN,2016-08-01
3271,DINDIGUL(TN)(Podis,December,2015,21200,1962,8192,5077,TN,DINDIGUL,2015-12-01
3261,DINDIGUL(TN)(Podis,November,2013,23950,4115,6977,5546,TN,DINDIGUL,2013-11-01
11185,TRIVENDRUM,October,2013,280,6000,6800,6400,KR,TRIVENDRUM,2013-10-01

###  Principle: Split Apply Combine

How do we get the sum of quantity for each city.

We need to **SPLIT** the data by each city, **APPLY** the sum to the quantity row and then **COMBINE** the data again


![](../img/splitapplycombine.png)


In pandas, we use the `groupby` function to do this.

In [35]:
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
0,ABOHAR(PB),January,2005,2350,404,493,446,PB,ABOHAR,2005-01-01
1,ABOHAR(PB),January,2006,900,487,638,563,PB,ABOHAR,2006-01-01
2,ABOHAR(PB),January,2010,790,1283,1592,1460,PB,ABOHAR,2010-01-01
3,ABOHAR(PB),January,2011,245,3067,3750,3433,PB,ABOHAR,2011-01-01
4,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR,2012-01-01

In [41]:
df.set_index(['year', 'month']).head()

,,market,quantity,priceMin,priceMax,priceMod,state,city,date
year,month,,,,,,,,
2005,January,ABOHAR(PB),2350,404,493,446,PB,ABOHAR,2005-01-01
2006,January,ABOHAR(PB),900,487,638,563,PB,ABOHAR,2006-01-01
2010,January,ABOHAR(PB),790,1283,1592,1460,PB,ABOHAR,2010-01-01
2011,January,ABOHAR(PB),245,3067,3750,3433,PB,ABOHAR,2011-01-01
2012,January,ABOHAR(PB),1035,523,686,605,PB,ABOHAR,2012-01-01

In [42]:
??df.groupby

In [44]:
df.set_index

<bound method DataFrame.set_index of            market     month  year  quantity  priceMin  priceMax  priceMod  \
0      ABOHAR(PB)   January  2005      2350       404       493       446
1      ABOHAR(PB)   January  2006       900       487       638       563
2      ABOHAR(PB)   January  2010       790      1283      1592      1460
3      ABOHAR(PB)   January  2011       245      3067      3750      3433
4      ABOHAR(PB)   January  2012      1035       523       686       605
5      ABOHAR(PB)   January  2013       675      1327      1900      1605
6      ABOHAR(PB)   January  2014       440      1025      1481      1256
7      ABOHAR(PB)   January  2015      1305      1309      1858      1613
8      ABOHAR(PB)   January  2017       200       750      1000       850
9      ABOHAR(PB)  February  2005      1400       286       365       324
10     ABOHAR(PB)  February  2006      1800       343       411       380
11     ABOHAR(PB)  February  2010       555      1143      1460      1322
12     ABOHAR(PB)  February  2011       300       950      1400      1125
13     ABOHAR(PB)  February  2012       675       510       650       570
14     ABOHAR(PB)  February  2013       845      1400      1843      1629
15     ABOHAR(PB)  February  2014      1115       831      1163       983
16     ABOHAR(PB)  February  2015      1115      1200      1946      1688
17     ABOHAR(PB)     March  2005       900       281       357       322
18     ABOHAR(PB)     March  2006      3185       359       425       391
19     ABOHAR(PB)     March  2010       385       510       878       688
20     ABOHAR(PB)     March  2011       850       669      1042       855
21     ABOHAR(PB)     March  2012      1295       538       675       608
22     ABOHAR(PB)     March  2013      1055       920      1323      1080
23     ABOHAR(PB)     March  2014      1300       844      1181       994
24     ABOHAR(PB)     March  2015       920      1260      1980      1745
25     ABOHAR(PB)     April  2006      2100       326       400       366
26     ABOHAR(PB)     April  2010       840       466       755       611
27     ABOHAR(PB)     April  2011       495       436       625       553
28     ABOHAR(PB)     April  2012      2028       486       709       573
29     ABOHAR(PB)     April  2013       932       892      1225      1035
...           ...       ...   ...       ...       ...       ...       ...
11652   YEOLA(MS)   October  2013     16879      1334      4857      4224
11653   YEOLA(MS)   October  2014     56506       290      1682      1293
11654   YEOLA(MS)   October  2015     15593      1046      3537      2886
11655   YEOLA(MS)   October  2016    132500       176       755       490
11656   YEOLA(MS)  November  2004     10190       160       396       320
11657   YEOLA(MS)  November  2005      3796       420      1139       994
11658   YEOLA(MS)  November  2006     29782       195       566       457
11659   YEOLA(MS)  November  2007     34027       463       828       705
11660   YEOLA(MS)  November  2008     50510       455      1045       935
11661   YEOLA(MS)  November  2009     43403       642      1639      1407
11662   YEOLA(MS)  November  2010     24107       796      2960      2112
11663   YEOLA(MS)  November  2011     69034       276      1248       603
11664   YEOLA(MS)  November  2012     89208       319      1225       884
11665   YEOLA(MS)  November  2013     33067       575      2698      2096
11666   YEOLA(MS)  November  2014     42531       444      1632      1339
11667   YEOLA(MS)  November  2015     62522      1003      2460      1996
11668   YEOLA(MS)  November  2016     45954       207       780       572
11669   YEOLA(MS)  December  2004     83888       149       320       276
11670   YEOLA(MS)  December  2005    105734       223       474       432
11671   YEOLA(MS)  December  2006    123824       273       656       577
11672   YEOLA(MS)  December  2007    232281       250       478       388
11673   YEOLA(MS)  December  2008    128291       503      1070       969
11674   YEOLA(MS)  December  2009    112061       479      1536      1018
11675   YEOLA(MS)  December  2010     57586       541      2713      1830
11676   YEOLA(MS)  December  2011    131326       282       612       526
11677   YEOLA(MS)  December  2012    207066       485      1327      1136
11678   YEOLA(MS)  December  2013    215883       472      1427      1177
11679   YEOLA(MS)  December  2014    201077       446      1654      1456
11680   YEOLA(MS)  December  2015    223315       609      1446      1126
11681   YEOLA(MS)  December  2016    214937       256       753       634

      state    city       date
0        PB  ABOHAR 2005-01-01
1        PB  ABOHAR 2006-01-01
2        PB  ABOHAR 2010-01-01
3        PB  ABOHAR 2011-01-01
4        PB  ABOHAR 2012-01-01
5        PB  ABOHAR 2013-01-01
6        PB  ABOHAR 2014-01-01
7        PB  ABOHAR 2015-01-01
8        PB  ABOHAR 2017-01-01
9        PB  ABOHAR 2005-02-01
10       PB  ABOHAR 2006-02-01
11       PB  ABOHAR 2010-02-01
12       PB  ABOHAR 2011-02-01
13       PB  ABOHAR 2012-02-01
14       PB  ABOHAR 2013-02-01
15       PB  ABOHAR 2014-02-01
16       PB  ABOHAR 2015-02-01
17       PB  ABOHAR 2005-03-01
18       PB  ABOHAR 2006-03-01
19       PB  ABOHAR 2010-03-01
20       PB  ABOHAR 2011-03-01
21       PB  ABOHAR 2012-03-01
22       PB  ABOHAR 2013-03-01
23       PB  ABOHAR 2014-03-01
24       PB  ABOHAR 2015-03-01
25       PB  ABOHAR 2006-04-01
26       PB  ABOHAR 2010-04-01
27       PB  ABOHAR 2011-04-01
28       PB  ABOHAR 2012-04-01
29       PB  ABOHAR 2013-04-01
...     ...     ...        ...
11652    MH   YEOLA 2013-10-01
11653    MH   YEOLA 2014-10-01
11654    MH   YEOLA 2015-10-01
11655    MH   YEOLA 2016-10-01
11656    MH   YEOLA 2004-11-01
11657    MH   YEOLA 2005-11-01
11658    MH   YEOLA 2006-11-01
11659    MH   YEOLA 2007-11-01
11660    MH   YEOLA 2008-11-01
11661    MH   YEOLA 2009-11-01
11662    MH   YEOLA 2010-11-01
11663    MH   YEOLA 2011-11-01
11664    MH   YEOLA 2012-11-01
11665    MH   YEOLA 2013-11-01
11666    MH   YEOLA 2014-11-01
11667    MH   YEOLA 2015-11-01
11668    MH   YEOLA 2016-11-01
11669    MH   YEOLA 2004-12-01
11670    MH   YEOLA 2005-12-01
11671    MH   YEOLA 2006-12-01
11672    MH   YEOLA 2007-12-01
11673    MH   YEOLA 2008-12-01
11674    MH   YEOLA 2009-12-01
11675    MH   YEOLA 2010-12-01
11676    MH   YEOLA 2011-12-01
11677    MH   YEOLA 2012-12-01
11678    MH   YEOLA 2013-12-01
11679    MH   YEOLA 2014-12-01
11680    MH   YEOLA 2015-12-01
11681    MH   YEOLA 2016-12-01

[11682 rows x 10 columns]>

In [45]:
df2016.groupby(['city']).quantity.sum().head()

city
ABOHAR                2440
AGRA               1348878
AHMEDABAD          2110393
AHMEDNAGAR         1289549
AIGINIA MANDIA       53550
Name: quantity, dtype: int64

In [46]:
# Group by using city
df2016City = df2016.groupby(['city']).sum()

In [47]:
df2016City.head()

                  year  quantity  priceMin  priceMax  priceMod
city
ABOHAR           12096      2440      3986      5679      4799
AGRA             24192   1348878     10239     13570     12182
AHMEDABAD        24192   2110393      5483     11405      8812
AHMEDNAGAR       22176   1289549      1451     13610      9084
AIGINIA MANDIA   10080     53550      5540      6529      6029

In [48]:
type(df2016City)

pandas.core.frame.DataFrame

In [49]:
# If we only want to apply the sum function on quantity, then we specify the quantity column
df2016City = df2016.groupby(['city']).quantity.sum()

In [51]:
df2016City = df2016.groupby(['city'], as_index=False).sum()

In [52]:
# Let us see this dataframe
df2016City.head()

              city   year  quantity  priceMin  priceMax  priceMod
0           ABOHAR  12096      2440      3986      5679      4799
1             AGRA  24192   1348878     10239     13570     12182
2        AHMEDABAD  24192   2110393      5483     11405      8812
3       AHMEDNAGAR  22176   1289549      1451     13610      9084
4  AIGINIA MANDIA   10080     53550      5540      6529      6029

In [47]:
# To create a dataframe again, it is best to specify index as false
df2016City = df2016.groupby(['city'], as_index=False).quantity.sum()

In [48]:
df.dtypes

market              object
month               object
year                 int64
quantity             int64
priceMin             int64
priceMax             int64
priceMod             int64
state               object
city                object
date        datetime64[ns]
dtype: object

In [49]:
df2016City.head()

              city  quantity
0           ABOHAR      2440
1             AGRA   1348878
2        AHMEDABAD   2110393
3       AHMEDNAGAR   1289549
4  AIGINIA MANDIA      53550

In [50]:
df.dtypes

market              object
month               object
year                 int64
quantity             int64
priceMin             int64
priceMax             int64
priceMod             int64
state               object
city                object
date        datetime64[ns]
dtype: object

### PRINCIPLE: Sorting

In [51]:
# Sort the Dataframe by Quantity to see which one is on top
df2016City = df2016City.sort_values(by = "quantity")
df2016City.head()

             city  quantity
156  SRINIVASPUR         70
32         CHALA        130
46          DEWAS       237
10          ANGUL       490
119    PALAMANER        500

In [52]:
df2016City = df2016City.sort_values(by = "quantity", ascending = False)
df2016City.head()

           city  quantity
15    BANGALORE   9117473
102      MAHUVA   6144573
126  PIMPALGAON   3836046
154     SOLAPUR   3767140
129        PUNE   3493535

### Exercise

Find the top 10 city with highest average monthly sales in the last 5 years (from 2012 to 2016)?

In [60]:
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
0,ABOHAR(PB),January,2005,2350,404,493,446,PB,ABOHAR,2005-01-01
1,ABOHAR(PB),January,2006,900,487,638,563,PB,ABOHAR,2006-01-01
2,ABOHAR(PB),January,2010,790,1283,1592,1460,PB,ABOHAR,2010-01-01
3,ABOHAR(PB),January,2011,245,3067,3750,3433,PB,ABOHAR,2011-01-01
4,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR,2012-01-01

In [61]:
df['value'] = df.quantity * df.priceMod

In [62]:
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date,value
0,ABOHAR(PB),January,2005,2350,404,493,446,PB,ABOHAR,2005-01-01,1048100
1,ABOHAR(PB),January,2006,900,487,638,563,PB,ABOHAR,2006-01-01,506700
2,ABOHAR(PB),January,2010,790,1283,1592,1460,PB,ABOHAR,2010-01-01,1153400
3,ABOHAR(PB),January,2011,245,3067,3750,3433,PB,ABOHAR,2011-01-01,841085
4,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR,2012-01-01,626175

In [65]:
df5yrs = df[(df.year > 2011) & (df.year <2017)].copy()

In [66]:
df5yrs.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date,value
4,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR,2012-01-01,626175
5,ABOHAR(PB),January,2013,675,1327,1900,1605,PB,ABOHAR,2013-01-01,1083375
6,ABOHAR(PB),January,2014,440,1025,1481,1256,PB,ABOHAR,2014-01-01,552640
7,ABOHAR(PB),January,2015,1305,1309,1858,1613,PB,ABOHAR,2015-01-01,2104965
13,ABOHAR(PB),February,2012,675,510,650,570,PB,ABOHAR,2012-02-01,384750

In [67]:
df5yrs['value'] = df5yrs.quantity * df5yrs.priceMod

In [68]:
df5yrs.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date,value
4,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR,2012-01-01,626175
5,ABOHAR(PB),January,2013,675,1327,1900,1605,PB,ABOHAR,2013-01-01,1083375
6,ABOHAR(PB),January,2014,440,1025,1481,1256,PB,ABOHAR,2014-01-01,552640
7,ABOHAR(PB),January,2015,1305,1309,1858,1613,PB,ABOHAR,2015-01-01,2104965
13,ABOHAR(PB),February,2012,675,510,650,570,PB,ABOHAR,2012-02-01,384750

In [59]:
df5yrs.groupby(['city']).quantity.mean().sort_values(ascending=False).head(10)

city
BANGALORE     669581.583333
MAHUVA        371856.694915
SOLAPUR       332377.816667
PUNE          296490.150000
DELHI         285956.700000
LASALGAON     280032.716667
PIMPALGAON    259157.966667
MUMBAI        224131.833333
BHAVNAGAR     190190.731707
NEWASA        188024.115385
Name: quantity, dtype: float64